trunk/resources/Comet/articles/Comet概念与实践/cometbug/app/controllers/bugs_controller.rb

  def show
    @bug = Bug.find(params[:id])
---
SELECT * FROM `bugs` WHERE (`bugs`.`id` = 1)

  def create
    @bug = Bug.new(params[:bug])

    respond_to do |format|
      if @bug.save
---
INSERT INTO `bugs` (`status`, `updated_at`, `description`, `created_at`) VALUES('Open', '2009-02-07 13:11:16', 'test', '2009-02-07 13:11:16')

  def edit
    @bug = Bug.find(params[:id])
---
SELECT * FROM `bugs` WHERE (`bugs`.`id` = 1)

  def update
    @bug = Bug.find(params[:id])

    respond_to do |format|
      if @bug.update_attributes(params[:bug])
---
SELECT * FROM `bugs` WHERE (`bugs`.`id` = 3)
UPDATE `bugs` SET `status` = 'Assigned', `description` = 'gffdfgfgfd', `updated_at` = '2009-02-07 16:12:11' WHERE `id` = 6